In [1]:
import pandas as pd

In [4]:
dataframe=pd.read_excel("C:/Users/Acer/Desktop/maas.xlsx")

In [5]:
dataframe

  Unnamed: 0  maas  yas departman
0        ali   100   21   yazılım
1      hakan   150   22    finans
2       kaya   200   23     hukuk
3       ayse   500   24   yazılım
4      ahmet   150   25     hukuk
5     dilara   200   26    finans

In [6]:
dataframe.dropna()

  Unnamed: 0  maas  yas departman
0        ali   100   21   yazılım
1      hakan   150   22    finans
2       kaya   200   23     hukuk
3       ayse   500   24   yazılım
4      ahmet   150   25     hukuk
5     dilara   200   26    finans